#+TITLE: De novo no Emacs

E lá vamos nós de novo, em mais um post que só demonstra o quanto que eu necessito me tratar.

* Eu não consigo
Mesmo depois de criar o meu próprio [[https://tukain.codeberg.page/tukain/blog.sh][SSG]], mesmo depois de ter reconfigurado o meu setup para que eu não precisasse mais do Emacs, mesmo depois de eu ter feito melhorias no meu Neovim, mesmo depois de tudo o que eu fiz nos últimos dias, cá estou eu, usando o Emacs de novo.

Eu não sei que síndrome de Stockolmo (definitivamente não é assim que se escreve) é essa que me assola, mas eu simplesmente não consigo, eu sempre volto a usar esse editor que é apenas 2 anos mais novo que o meu pai.

Eu sempre volto a usar esse trambolho lerdo e configurado com uma linguagem que é utilizada somente nele.

Eu sempre volto a refazer o meu site usando ele.

Eu sempre volto a fazer minhas anotações nele.

Eu não sei mais o que fazer para sair dele. (Não venha com papo de apertar =Ctrl x=, =Ctrl c= perto de mim não, fazendo favor).

* Sim, eu refiz (pela terceira vez) o meu site usando org-mode
Essa é a parte que genuinamente mais me assusta, porque simplesmente não tem como uma pessoa em sã consciência ficar fazendo o que eu faço comigo mesmo, se tratando de um site, é claro. Eu é que não vou querer duvidar das coisas que as pessoas fazem.

Eu sinceramente nem sei muito bem o que dizer, afinal o resultado final não difere muito do resultado final do meu SSG. O que é proposital, até porque o meu SSG foi criado com o intuíto de ser o meu escapismo de utilizar o org-mode para fazer o meu site.

Mas acabou que no final das contas, eu voltei a usar o org-mode.

* Eu não estou usando o Emacs apenas na minha máquina
Um dos motivos de eu ter voltado a usar o Emacs é bem direto ao ponto:
Eu nunca deixei de usar ele. Para ser mais exato, eu tenho uma configuração reduzida do Emacs que eu uso no computador do local onde trabalho (não tem nada haver com programação), e nos últimos dias, eu comecei a usar o Emacs como a minha "suíte office", de certa forma.

O que quero dizer com isso é que eu comecei a utilizar o Emacs como o meu meio predileto de criar documentos e planilhas. Bom, eu já tinha noção do quão bom era fazer documentos com o Emacs, afinal de contas o meu blog inteiro é feito utilizando o Emacs. Mas planilhas...

* Planilhas
Qual a diferença de uma tabela para uma planilha? Na minha visão, são fórmulas.

Você usa uma tabela quando os dados que vão estar presentes nela não mudam, ou se mudam, é feito de forma manual. Agora uma planilha precisa ter uma fórmula para funcionar.

Digamos que você tenha uma planilha contendo todas as suas compras do mês, você poderia simplesmente sair somando cada preço e no fim ter o total que você gastou, mas ninguém tem saco pra isso. Então a solução é simples: você põe uma fórmula que faz a soma de todos os itens na colona de valores.

Digamos que você esteja usando o Google Sheets, a planilha poderia ser algo +/- assim:

#+begin_example 
| A         |             B |
| Item      |         Valor |
|-----------+---------------|
| Maçã      |             6 |
| Ovos      |            12 |
| Leite     |            20 |
| Farinha   |             7 |
| Margarina |            12 |
|-----------+---------------|
| total     | =soma(B3:B7)  |
#+end_example

Eu não lembro muito bem a sintaxe do Google Sheets, mas já serve de exemplo. Basicamente o que a fórmula =soma= está fazendo é... bom, fazendo uma soma dos valores que estão presentes na linha 4 da coluna B até a linha 7 da colona B, o que você veria no final seria apenas o valor que essa fórmula retornou.

E isso também é possível de se fazer usando o Emacs!

A sintaxe muda, claro, mas no final do dia, o que importa é o resultado. Usando o org-mode, a sintaxe para a mesma planilha seria:

#+begin_src org
| Item      | Valor |
|-----------+-------|
| Maçã      |     6 |
| Ovos      |    12 |
| Leite     |    20 |
| Farinha   |     7 |
| Margarina |    12 |
|-----------+-------|
| total     |    57 |
#+TBLFM: @>$2=vsum(@I..@II)
#+end_src

A maior diferença aqui é onde a fórmula é posicionada, diferentemente do convecional, as fórmulas do org-mode ficam localizadas fora da tabela. O resto é só questão de sintaxe. "=@>=" significa "última linha de", "=$2=" representa a "segunda coluna". Não sei dizer exatamente o que significa o "=@I..@II=", porém, o que eu acho que seja é que esses I's representam os delimitadores das células (os caracters "=-=").

* Quais são as vantagens?
Bom, em questão de funcionalidade básicas, ambos ótimas escolhas, dependendo do seu tipo de uso e em qual nível de usabilidade você melhor se encaixa. Porém, uma coisa que é mais que um motivo para você reconsiderar na hora de escolher fazer uma planilha usando o Google Sheets é: Todo e qualquer caractere da planilha é enviado para os servidores do Google... Bom, você já deve saber de toda essa parafernalha que é privacidade na internet.

Em contra-partida, você não precisa de internet para usar o Emacs, como também tem todo o conteúdo-fonte preservado em texto puro. Dessa forma é extremamente fácil de se fazer backups dos arquivos, sem se falar que com um /simples/ =Ctrl c=, =Ctrl e=, =h=, =h=, é possível gerar um arquivo HTML, pronto para ser impresso ou publicado.

* Se ele é bom no trabalho, então ele também é bom em casa
Só de eu conseguir utilizar ele no trabalho tranquilamente, já demonstra o quão refinado o Emacs é. Da mesma forma que eu fiz planilhas utilizando o Emacs no meu trabalho, eu também posso fazer algumas para meu uso pessoal, em casa.

A minha configuração pessoal e a configuração que eu tenho no meu trabalho tem diferenças que se resumem à minha tendo um /rice/ e a do meu trabalho tendo pouquíssimas coisas que não são nativas, afinal, eu não tenho muito o porquê de fazer um rice pro Emacs que eu uso no meu trabalho.

Ainda estou me organizando, mas quando finalizar, até mesmo a agenda do Emacs eu vou usar (sim, essa porra tem uma agenda também).

* /Fin/
Bom, é isso, até o próximo post!
